dam_wall_3d/fluid-openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          560;
        startFace       64969;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          560;
        startFace       65529;
    }
    flap
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          656;
        startFace       66089;
    }
    upperWall
    {
        type            patch;
        nFaces          656;
        startFace       66745;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          640;
        startFace       67401;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1415;
        startFace       68041;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1415;
        startFace       69456;
    }
)

// ************************************************************************* //
