dam_wall_3d/fluid-openfoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-3 0 0) (-1.0 4.0 2.0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    
    boxToCell
    {
        box (2 1 0) (3.0 5.0 4.0);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
    
);


// ************************************************************************* //
